# AnalyticalDefineThermalPropertiesBy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalDefineThermalPropertiesBy Property
ParameterTypeId Class See Also
---
"Define Thermal Properties by"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalDefineThermalPropertiesBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalDefineThermalPropertiesBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalDefineThermalPropertiesBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace